{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 22311, "word_counts": "{\"steak\": 276, \"onion\": 7125, \"wine\": 1172, \"soy\": 871, \"oil\": 5049, \"sesame\": 499, \"sugar\": 10580, \"pepper\": 7879, \"ginger\": 1024, \"garlic\": 4408, \"odd\": 32947, \"ingredient\": 32947, \"thyme\": 661, \"paprika\": 696, \"chicken\": 3312, \"mushroom\": 1620, \"carrot\": 963, \"piece\": 910, \"olive\": 3505, \"grape\": 208, \"celery\": 1473, \"water\": 4577, \"butter\": 6488, \"lemon\": 3097, \"flour\": 6102, \"salt\": 12276, \"baking\": 2847, \"powder\": 2129, \"egg\": 7232, \"vinegar\": 1345, \"ice\": 354, \"pretzels\": 47, \"margarine\": 1233, \"orange\": 1312, \"juice\": 2014, \"cinnamon\": 1847, \"allspice\": 237, \"tomato\": 3156, \"die\": 981, \"sauce\": 1100, \"worcestershire\": 685, \"prepared\": 136, \"mustard\": 1265, \"sour\": 1357, \"cream\": 4533, \"parsley\": 1473, \"dill\": 344, \"honey\": 789, \"dijon\": 382, \"beef\": 1500, \"bread\": 1164, \"milk\": 4436, \"strawberry\": 590, \"raisin\": 535, \"apricot\": 198, \"pineapple\": 941, \"peach\": 230, \"pecan\": 905, \"vanilla\": 3496, \"chocolate\": 1659, \"cheese\": 1447, \"cool\": 510, \"whip\": 510, \"vegetable\": 1622, \"nut\": 865, \"soda\": 1195, \"bacon\": 690, \"basil\": 801, \"parmesan\": 1182, \"pork\": 654, \"cocoa\": 634, \"walnut\": 647, \"rice\": 1304, \"paste\": 298, \"bay\": 263, \"leaf\": 263, \"velveeta\": 161, \"shortening\": 546, \"hamburger\": 248, \"mozzarella\": 514, \"grated\": 151, \"almond\": 852, \"ground\": 368, \"cumin\": 684, \"coriander\": 263, \"mint\": 243, \"fish\": 224, \"maple\": 217, \"syrup\": 345, \"lime\": 427, \"cornmeal\": 233, \"of\": 127, \"tartar\": 127, \"chili\": 477, \"potato\": 1358, \"mayonnaise\": 984, \"cornstarch\": 548, \"marshmallow\": 348, \"catsup\": 130, \"nutmeg\": 760, \"tarragon\": 117, \"oregano\": 712, \"cheddar\": 1271, \"whipping\": 396, \"dry\": 278, \"coconut\": 698, \"heavy\": 505, \"sunflower\": 93, \"sherry\": 196, \"raspberry\": 267, \"muffin\": 58, \"shallot\": 403, \"graham\": 129, \"cracker\": 129, \"crumbs\": 129, \"yellow\": 168, \"cake\": 168, \"mix\": 168, \"yogurt\": 391, \"ricotta\": 191, \"light\": 128, \"corn\": 128, \"chopped\": 412, \"nuts\": 412, \"tabasco\": 171, \"beet\": 72, \"relish\": 53, \"cottage\": 199, \"crab\": 90, \"cooking\": 217, \"spray\": 217, \"anise\": 49, \"gelatin\": 185, \"italian\": 163, \"seasoning\": 163, \"turkey\": 322, \"curry\": 239, \"squash\": 226, \"lamb\": 100, \"halibut\": 22, \"mango\": 126, \"cashews\": 73, \"radish\": 84, \"wasabi\": 16, \"cardamom\": 106, \"gruyere\": 71, \"karo\": 74, \"meringue\": 14, \"coleslaw\": 23, \"endive\": 20, \"doritos\": 23, \"custard\": 11}", "word_docs": "{\"soy\": 818, \"oil\": 4684, \"ginger\": 982, \"sugar\": 8519, \"garlic\": 4207, \"steak\": 266, \"onion\": 6765, \"pepper\": 6138, \"sesame\": 416, \"wine\": 1130, \"odd\": 16459, \"mushroom\": 1482, \"thyme\": 641, \"carrot\": 951, \"water\": 4209, \"ingredient\": 16459, \"chicken\": 2627, \"grape\": 202, \"celery\": 1421, \"olive\": 3113, \"piece\": 778, \"paprika\": 679, \"butter\": 5728, \"lemon\": 2651, \"baking\": 2338, \"egg\": 6747, \"salt\": 10717, \"ice\": 337, \"powder\": 2106, \"flour\": 5675, \"vinegar\": 1330, \"margarine\": 1198, \"pretzels\": 47, \"orange\": 1054, \"juice\": 1951, \"cinnamon\": 1774, \"allspice\": 235, \"sauce\": 1046, \"tomato\": 2726, \"die\": 833, \"mustard\": 1214, \"worcestershire\": 679, \"prepared\": 136, \"dill\": 323, \"sour\": 1344, \"parsley\": 1443, \"cream\": 3989, \"honey\": 763, \"dijon\": 380, \"beef\": 1381, \"bread\": 1136, \"milk\": 4218, \"strawberry\": 467, \"raisin\": 529, \"apricot\": 180, \"pineapple\": 885, \"peach\": 215, \"chocolate\": 1339, \"vanilla\": 3261, \"pecan\": 867, \"cool\": 500, \"whip\": 500, \"cheese\": 1419, \"vegetable\": 1543, \"nut\": 833, \"soda\": 1191, \"bacon\": 675, \"basil\": 763, \"parmesan\": 1136, \"pork\": 630, \"walnut\": 614, \"cocoa\": 593, \"rice\": 1238, \"paste\": 297, \"velveeta\": 161, \"bay\": 261, \"leaf\": 261, \"shortening\": 539, \"hamburger\": 248, \"mozzarella\": 508, \"almond\": 746, \"grated\": 150, \"coriander\": 254, \"cumin\": 660, \"ground\": 359, \"maple\": 207, \"lime\": 415, \"fish\": 210, \"syrup\": 332, \"mint\": 233, \"cornmeal\": 229, \"tartar\": 126, \"of\": 126, \"chili\": 473, \"potato\": 1303, \"mayonnaise\": 968, \"cornstarch\": 538, \"marshmallow\": 342, \"catsup\": 130, \"nutmeg\": 752, \"tarragon\": 113, \"oregano\": 704, \"cheddar\": 1239, \"whipping\": 375, \"dry\": 276, \"coconut\": 638, \"heavy\": 483, \"sunflower\": 90, \"raspberry\": 222, \"sherry\": 195, \"muffin\": 58, \"shallot\": 386, \"cracker\": 128, \"graham\": 128, \"crumbs\": 128, \"cake\": 168, \"yellow\": 168, \"mix\": 168, \"yogurt\": 382, \"ricotta\": 187, \"light\": 128, \"corn\": 128, \"chopped\": 410, \"nuts\": 410, \"tabasco\": 170, \"beet\": 69, \"relish\": 52, \"cottage\": 198, \"crab\": 84, \"cooking\": 217, \"spray\": 217, \"anise\": 46, \"gelatin\": 173, \"italian\": 160, \"seasoning\": 160, \"turkey\": 298, \"curry\": 235, \"squash\": 217, \"lamb\": 96, \"halibut\": 21, \"mango\": 113, \"cashews\": 71, \"radish\": 80, \"wasabi\": 16, \"cardamom\": 102, \"gruyere\": 69, \"karo\": 72, \"meringue\": 14, \"coleslaw\": 23, \"endive\": 19, \"doritos\": 23, \"custard\": 11}", "index_docs": "{\"51\": 818, \"10\": 4684, \"44\": 982, \"4\": 8519, \"14\": 4207, \"92\": 266, \"7\": 6765, \"5\": 6138, \"75\": 416, \"41\": 1130, \"1\": 16459, \"26\": 1482, \"63\": 641, \"47\": 951, \"11\": 4209, \"2\": 16459, \"17\": 2627, \"108\": 202, \"28\": 1421, \"15\": 3113, \"49\": 778, \"59\": 679, \"8\": 5728, \"19\": 2651, \"20\": 2338, \"6\": 6747, \"3\": 10717, \"85\": 337, \"21\": 2106, \"9\": 5675, \"33\": 1330, \"38\": 1198, \"145\": 47, \"34\": 1054, \"22\": 1951, \"23\": 1774, \"100\": 235, \"43\": 1046, \"18\": 2726, \"46\": 833, \"37\": 1214, \"61\": 679, \"122\": 136, \"88\": 323, \"32\": 1344, \"29\": 1443, \"12\": 3989, \"55\": 763, \"83\": 380, \"27\": 1381, \"42\": 1136, \"13\": 4218, \"67\": 467, \"70\": 529, \"110\": 180, \"48\": 885, \"102\": 215, \"24\": 1339, \"16\": 3261, \"50\": 867, \"72\": 500, \"73\": 500, \"30\": 1419, \"25\": 1543, \"52\": 833, \"39\": 1191, \"60\": 675, \"54\": 763, \"40\": 1136, \"64\": 630, \"65\": 614, \"66\": 593, \"35\": 1238, \"90\": 297, \"120\": 161, \"94\": 261, \"95\": 261, \"69\": 539, \"97\": 248, \"71\": 508, \"53\": 746, \"121\": 150, \"96\": 254, \"62\": 660, \"84\": 359, \"105\": 207, \"77\": 415, \"104\": 210, \"87\": 332, \"98\": 233, \"101\": 229, \"130\": 126, \"129\": 126, \"76\": 473, \"31\": 1303, \"45\": 968, \"68\": 538, \"86\": 342, \"123\": 130, \"56\": 752, \"132\": 113, \"57\": 704, \"36\": 1239, \"81\": 375, \"91\": 276, \"58\": 638, \"74\": 483, \"135\": 90, \"93\": 222, \"111\": 195, \"142\": 58, \"80\": 386, \"125\": 128, \"124\": 128, \"126\": 128, \"116\": 168, \"115\": 168, \"117\": 168, \"82\": 382, \"112\": 187, \"127\": 128, \"128\": 128, \"78\": 410, \"79\": 410, \"114\": 170, \"140\": 69, \"143\": 52, \"109\": 198, \"136\": 84, \"106\": 217, \"107\": 217, \"144\": 46, \"113\": 173, \"118\": 160, \"119\": 160, \"89\": 298, \"99\": 235, \"103\": 217, \"134\": 96, \"148\": 21, \"131\": 113, \"139\": 71, \"137\": 80, \"150\": 16, \"133\": 102, \"141\": 69, \"138\": 72, \"151\": 14, \"146\": 23, \"149\": 19, \"147\": 23, \"152\": 11}", "index_word": "{\"1\": \"odd\", \"2\": \"ingredient\", \"3\": \"salt\", \"4\": \"sugar\", \"5\": \"pepper\", \"6\": \"egg\", \"7\": \"onion\", \"8\": \"butter\", \"9\": \"flour\", \"10\": \"oil\", \"11\": \"water\", \"12\": \"cream\", \"13\": \"milk\", \"14\": \"garlic\", \"15\": \"olive\", \"16\": \"vanilla\", \"17\": \"chicken\", \"18\": \"tomato\", \"19\": \"lemon\", \"20\": \"baking\", \"21\": \"powder\", \"22\": \"juice\", \"23\": \"cinnamon\", \"24\": \"chocolate\", \"25\": \"vegetable\", \"26\": \"mushroom\", \"27\": \"beef\", \"28\": \"celery\", \"29\": \"parsley\", \"30\": \"cheese\", \"31\": \"potato\", \"32\": \"sour\", \"33\": \"vinegar\", \"34\": \"orange\", \"35\": \"rice\", \"36\": \"cheddar\", \"37\": \"mustard\", \"38\": \"margarine\", \"39\": \"soda\", \"40\": \"parmesan\", \"41\": \"wine\", \"42\": \"bread\", \"43\": \"sauce\", \"44\": \"ginger\", \"45\": \"mayonnaise\", \"46\": \"die\", \"47\": \"carrot\", \"48\": \"pineapple\", \"49\": \"piece\", \"50\": \"pecan\", \"51\": \"soy\", \"52\": \"nut\", \"53\": \"almond\", \"54\": \"basil\", \"55\": \"honey\", \"56\": \"nutmeg\", \"57\": \"oregano\", \"58\": \"coconut\", \"59\": \"paprika\", \"60\": \"bacon\", \"61\": \"worcestershire\", \"62\": \"cumin\", \"63\": \"thyme\", \"64\": \"pork\", \"65\": \"walnut\", \"66\": \"cocoa\", \"67\": \"strawberry\", \"68\": \"cornstarch\", \"69\": \"shortening\", \"70\": \"raisin\", \"71\": \"mozzarella\", \"72\": \"cool\", \"73\": \"whip\", \"74\": \"heavy\", \"75\": \"sesame\", \"76\": \"chili\", \"77\": \"lime\", \"78\": \"chopped\", \"79\": \"nuts\", \"80\": \"shallot\", \"81\": \"whipping\", \"82\": \"yogurt\", \"83\": \"dijon\", \"84\": \"ground\", \"85\": \"ice\", \"86\": \"marshmallow\", \"87\": \"syrup\", \"88\": \"dill\", \"89\": \"turkey\", \"90\": \"paste\", \"91\": \"dry\", \"92\": \"steak\", \"93\": \"raspberry\", \"94\": \"bay\", \"95\": \"leaf\", \"96\": \"coriander\", \"97\": \"hamburger\", \"98\": \"mint\", \"99\": \"curry\", \"100\": \"allspice\", \"101\": \"cornmeal\", \"102\": \"peach\", \"103\": \"squash\", \"104\": \"fish\", \"105\": \"maple\", \"106\": \"cooking\", \"107\": \"spray\", \"108\": \"grape\", \"109\": \"cottage\", \"110\": \"apricot\", \"111\": \"sherry\", \"112\": \"ricotta\", \"113\": \"gelatin\", \"114\": \"tabasco\", \"115\": \"yellow\", \"116\": \"cake\", \"117\": \"mix\", \"118\": \"italian\", \"119\": \"seasoning\", \"120\": \"velveeta\", \"121\": \"grated\", \"122\": \"prepared\", \"123\": \"catsup\", \"124\": \"graham\", \"125\": \"cracker\", \"126\": \"crumbs\", \"127\": \"light\", \"128\": \"corn\", \"129\": \"of\", \"130\": \"tartar\", \"131\": \"mango\", \"132\": \"tarragon\", \"133\": \"cardamom\", \"134\": \"lamb\", \"135\": \"sunflower\", \"136\": \"crab\", \"137\": \"radish\", \"138\": \"karo\", \"139\": \"cashews\", \"140\": \"beet\", \"141\": \"gruyere\", \"142\": \"muffin\", \"143\": \"relish\", \"144\": \"anise\", \"145\": \"pretzels\", \"146\": \"coleslaw\", \"147\": \"doritos\", \"148\": \"halibut\", \"149\": \"endive\", \"150\": \"wasabi\", \"151\": \"meringue\", \"152\": \"custard\"}", "word_index": "{\"odd\": 1, \"ingredient\": 2, \"salt\": 3, \"sugar\": 4, \"pepper\": 5, \"egg\": 6, \"onion\": 7, \"butter\": 8, \"flour\": 9, \"oil\": 10, \"water\": 11, \"cream\": 12, \"milk\": 13, \"garlic\": 14, \"olive\": 15, \"vanilla\": 16, \"chicken\": 17, \"tomato\": 18, \"lemon\": 19, \"baking\": 20, \"powder\": 21, \"juice\": 22, \"cinnamon\": 23, \"chocolate\": 24, \"vegetable\": 25, \"mushroom\": 26, \"beef\": 27, \"celery\": 28, \"parsley\": 29, \"cheese\": 30, \"potato\": 31, \"sour\": 32, \"vinegar\": 33, \"orange\": 34, \"rice\": 35, \"cheddar\": 36, \"mustard\": 37, \"margarine\": 38, \"soda\": 39, \"parmesan\": 40, \"wine\": 41, \"bread\": 42, \"sauce\": 43, \"ginger\": 44, \"mayonnaise\": 45, \"die\": 46, \"carrot\": 47, \"pineapple\": 48, \"piece\": 49, \"pecan\": 50, \"soy\": 51, \"nut\": 52, \"almond\": 53, \"basil\": 54, \"honey\": 55, \"nutmeg\": 56, \"oregano\": 57, \"coconut\": 58, \"paprika\": 59, \"bacon\": 60, \"worcestershire\": 61, \"cumin\": 62, \"thyme\": 63, \"pork\": 64, \"walnut\": 65, \"cocoa\": 66, \"strawberry\": 67, \"cornstarch\": 68, \"shortening\": 69, \"raisin\": 70, \"mozzarella\": 71, \"cool\": 72, \"whip\": 73, \"heavy\": 74, \"sesame\": 75, \"chili\": 76, \"lime\": 77, \"chopped\": 78, \"nuts\": 79, \"shallot\": 80, \"whipping\": 81, \"yogurt\": 82, \"dijon\": 83, \"ground\": 84, \"ice\": 85, \"marshmallow\": 86, \"syrup\": 87, \"dill\": 88, \"turkey\": 89, \"paste\": 90, \"dry\": 91, \"steak\": 92, \"raspberry\": 93, \"bay\": 94, \"leaf\": 95, \"coriander\": 96, \"hamburger\": 97, \"mint\": 98, \"curry\": 99, \"allspice\": 100, \"cornmeal\": 101, \"peach\": 102, \"squash\": 103, \"fish\": 104, \"maple\": 105, \"cooking\": 106, \"spray\": 107, \"grape\": 108, \"cottage\": 109, \"apricot\": 110, \"sherry\": 111, \"ricotta\": 112, \"gelatin\": 113, \"tabasco\": 114, \"yellow\": 115, \"cake\": 116, \"mix\": 117, \"italian\": 118, \"seasoning\": 119, \"velveeta\": 120, \"grated\": 121, \"prepared\": 122, \"catsup\": 123, \"graham\": 124, \"cracker\": 125, \"crumbs\": 126, \"light\": 127, \"corn\": 128, \"of\": 129, \"tartar\": 130, \"mango\": 131, \"tarragon\": 132, \"cardamom\": 133, \"lamb\": 134, \"sunflower\": 135, \"crab\": 136, \"radish\": 137, \"karo\": 138, \"cashews\": 139, \"beet\": 140, \"gruyere\": 141, \"muffin\": 142, \"relish\": 143, \"anise\": 144, \"pretzels\": 145, \"coleslaw\": 146, \"doritos\": 147, \"halibut\": 148, \"endive\": 149, \"wasabi\": 150, \"meringue\": 151, \"custard\": 152}"}}